[
  {
    "title": "PROFESSIONAL EXPERIENCE",
    "details": "PROFESSIONAL EXPERIENCE\nEnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 \t\nChange Manager\nDeveloped and delivered change and communication strategies for system upgrades and new tech rollouts.\nCreated support materials, training content, and stakeholder briefs tailored to various user groups.\nLed feedback survey design, impact assessments, and messaging reviews with cross-functional teams.\nPartnered with project leads and change managers to document readiness status and improve adoption.\nMaintained SharePoint intranet content, incorporating feedback and ensuring updates were well-organised.\nSupported senior leadership presentations, storyboarding data and technical changes into clear messages.\nContributed to team capability uplift through coaching and playbook creation.\n\nAIG Australia Limited\t\t\t\t\t\t\t\t\t\tJan 2020 – Oct 2024 \t\nProgram Manager – Business Transformation & ICT Projects\nDelivered a portfolio of enterprise system enhancements and ICT infrastructure upgrades under hybrid methodologies.\nManaged third-party contract resources supporting business and technical change, data migration, and training.\nFacilitated requirements workshops, translated technical needs, and oversaw solution implementation.\nProduced risk registers, benefit realisation plans, and closure documentation for audit and compliance review.\nMonitored progress using Microsoft Project and produced executive-ready communications and reports.\n\nAIG Shared Services\t\t\t\t\t\t\t\t\t\tJan 2011 – Dec 2018 \t\nICT Projects & Operations Lead – Shared Services APAC\nManaged technology transition projects including end-user computing refresh, service desk platform upgrades, and process reengineering.\nWorked with global teams to coordinate rollouts, vendor schedules, and change readiness.\nSupervised contract resource delivery and managed technical documentation, test planning, and transition to BAU.\nMaintained high standards in operational handover, systems training, and ongoing support coordination.\nSupported continuous improvement activities and implemented lessons learned tracking.\n\nACS Xerox\t\t\t\t\t\t\t\t\t\t\tJan 2010 – Nov 2011 \t\nProcess Improvement Leader\nFacilitated call centre transformation using Lean Six Sigma resulting in 10% cost reduction and improved customer satisfaction scores.\nIntroduced a real-time performance dashboard to monitor and improve agent productivity, adopted enterprise-wide.\nPartnered with operations to design training rollout strategies that achieved 100% compliance with updated process standards."
  }
]