[
  {
    "title": "EnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 \t",
    "details": "EnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 \t\nChange Lead – Regulatory Compliance\nDelivered regulatory transformation initiatives across utilities operations, focusing on systems and process alignment with compliance mandates.\nMapped business processes for compliance and field operations teams, supporting stakeholder-driven re-engineering efforts.\nDocumented detailed requirements and user stories, coordinating with architects and implementation teams to validate system impacts.\nOrganized and facilitated cross-functional workshops to ensure alignment across Operations and Compliance.\nAssisted project governance by maintaining risk logs, preparing steering committee briefs, and ensuring alignment with enterprise frameworks.\nActed as a liaison between field operations, regulatory teams, and project stakeholders, ensuring consistent understanding and timely communication.\nAIG Australia Limited\t\t\t\t\t\t\t\t\t\tJan 2020 – Oct 2024 \t\nOperations Program Lead and Business Support\nDirected strategic project delivery and reporting for enterprise-wide technology programs in alignment with executive leadership goals.\nCollaborated with senior leadership to design and track progress across digital transformation roadmaps, including website and CRM upgrades.\nManaged IT budgets and led financial tracking efforts to support strategic forecasts, CAPEX, OPEX, and vendor cost optimization.\nDeveloped and enforced governance standards across project documentation, performance tracking, and risk reporting.\nActed as liaison between web development, infrastructure, and compliance teams, resolving blockers and ensuring delivery milestones.\nContributed to executive presentations and board committee updates, communicating insights and risks to senior decision-makers.\nAIG Shared Services\t\t\t\t\t\t\t\t\t\tJan 2011 – Dec 2018 \t\nIT Business Manager\nOversaw regional and global technology projects, leading web application development and infrastructure migration activities across distributed teams.\nManaged vendor engagement and technology partner relationships for CRM, security, and infrastructure support across multi-region operations.\nImplemented internal governance frameworks to improve service delivery, tracking SLAs and integrating audit checkpoints across IT operations.\nLed teams of analysts, testers, and developers through the full SDLC, ensuring consistency in delivery standards and continuous improvement.\nFacilitated steering committees and risk workshops, capturing feedback and translating into action plans to support IT transformation.\nSupported business continuity planning and infrastructure modernization using AWS and Azure services\nACS Xerox\t\t\t\t\t\t\t\t\t\t\tJan 2010 – Nov 2011 \t\nProcess Improvement Leader\nIdentified process inefficiencies in utilities support environments and recommended technology and workflow optimizations.\nCreated process maps for customer handling and asset support processes.\nDeveloped training materials and communication campaigns to support implementation of new processes.\nEngaged operational stakeholders through workshops and performance reviews to monitor post-change outcomes.\nProvided business analysis and documentation for proposed support tools and workflows.\nSupported business case development and alignment with utility domain KPIs.\nReferee details available on request"
  }
]