[
  {
    "title": "PROFESSIONAL EXPERIENCE",
    "details": "PROFESSIONAL EXPERIENCE"
  },
  {
    "title": "EnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 \t",
    "details": "EnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 \t\nChange Lead – Regulatory Compliance\nDelivered regulatory transformation initiatives across utilities operations, focusing on systems and process alignment with compliance mandates.\nMapped business processes for compliance and field operations teams, supporting stakeholder-driven re-engineering efforts.\nDocumented detailed requirements and user stories, coordinating with architects and implementation teams to validate system impacts.\nOrganized and facilitated cross-functional workshops to ensure alignment across Operations and Compliance.\nAssisted project governance by maintaining risk logs, preparing steering committee briefs, and ensuring alignment with enterprise frameworks.\nActed as a liaison between field operations, regulatory teams, and project stakeholders, ensuring consistent understanding and timely communication."
  },
  {
    "title": "AIG Australia Limited\t\t\t\t\t\t\t\t\t\tJan 2020 – Oct 2024 \t",
    "details": "AIG Australia Limited\t\t\t\t\t\t\t\t\t\tJan 2020 – Oct 2024 \t\nOperations Program Lead and Business Support\nFacilitated stakeholder engagement across multiple departments to gather functional and technical requirements.\nCreated process flow diagrams, detailed user stories, and operational documentation.\nParticipated in Agile ceremonies including sprint planning, reviews, and retrospectives.\nSupported change communications and stakeholder alignment activities during project rollouts.\nDeveloped SOPs and post-launch business support guides.\nWorked closely with developers and testers to translate user requirements into actionable development tasks."
  },
  {
    "title": "AIG Shared Services\t\t\t\t\t\t\t\t\t\tJan 2011 – Dec 2018 \t",
    "details": "AIG Shared Services\t\t\t\t\t\t\t\t\t\tJan 2011 – Dec 2018 \t\nIT Business Project Manager / Business Analyst\nConducted stakeholder workshops to elicit requirements and build end-to-end process maps.\nDeveloped workflows using Visio and Miro for business approvals, service escalation, and data governance.\nAuthored comprehensive technical documentation and supported business case development.\nCollaborated with developers and test teams to validate requirements and support UAT.\nProvided support for change initiatives including impact assessments and stakeholder communications.\nDelivered training documentation and knowledge transfer plans post-deployment.\nRegularly worked with cross-functional teams across digital, IT, and operations."
  },
  {
    "title": "ACS Xerox\t\t\t\t\t\t\t\t\t\t\tJan 2010 – Nov 2011 \t",
    "details": "ACS Xerox\t\t\t\t\t\t\t\t\t\t\tJan 2010 – Nov 2011 \t\nProcess Improvement Leader\nDelivered business analysis and process improvement services for client support and digital transformation programs.\nAnalysed workflows and system interactions, recommending process re-engineering to enhance service quality.\nSupported delivery of updated SOPs and training materials aligned to newly adopted technologies and workflows.\nDeveloped dashboards and status reports to track implementation readiness and success metrics.\nParticipated in workshops to validate revised business processes and drive user adoption strategies.\nCollaborated closely with operational stakeholders to ensure requirements met both business logic and customer experience objectives.\nReferee details available on request"
  }
]