[
  {
    "title": "EnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 \t",
    "details": "EnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 \t\nChange Manager – External Regulatory Changes\nLead requirements gathering, feasibility studies, and software design documentation for key change initiatives.\nTranslate business processes into system specifications across multiple platforms.\nCollaborate with IT, compliance, and operations teams to assess technical impacts and propose system enhancements.\nDevelop functional specifications and collaborate with delivery teams through sprints and testing cycles.\nSupport testing activities including test planning, execution, and defect tracking.\nProvide peer review and contribute to documentation quality assurance processes.\nGuide project stakeholders through solution design outcomes and user training.\nAIG Australia Limited\t\t\t\t\t\t\t\t\t\tJan 2020 – Oct 2024 \t\nIT and Operations - Business Support\nSupported ERP and system transformations with a focus on Finance, HR, and procurement reporting.\nCollaborated with business SMEs to gather and analyse operational reporting needs.\nAuthored business and functional requirements for system integration points.\nCoordinated end-to-end testing phases, including UAT cycles and resolution tracking.\nDelivered stakeholder briefings and post-implementation support documentation.\nProvided hands-on support for dashboard transition from legacy systems to Power BI.\nAIG Shared Services\t\t\t\t\t\t\t\t\t\tJan 2011 – Dec 2018 \t\nICT Business Analyst & Technical Support Lead\nLed business process reviews and reporting enhancements within shared services functions.\nDesigned future-state operating models for reporting teams supporting HR and compliance.\nAssisted in change impact analysis and coordinated testing activities across the program lifecycle.\nFacilitated reporting-related training sessions and knowledge sharing initiatives.\nDeveloped business cases for reporting tool upgrades and automation initiatives.\nDelivered insights and documentation aligned with operating model redesign objectives.\nACS Xerox\t\t\t\t\t\t\t\t\t\t\tJan 2010 – Nov 2011 \t\nProcess Improvement Leader\nKey Projects & Achievements:\nFacilitated call centre transformation using Lean Six Sigma resulting in 10% cost reduction and improved customer satisfaction scores.\nIntroduced a real-time performance dashboard to monitor and improve agent productivity, adopted enterprise-wide.\nPartnered with operations to design training rollout strategies that achieved 100% compliance with updated process standards.\nEDUCATION & CERTIFICATION\nBachelor of Information Technology | Kent University (2025)\nCert IV in Security Networking | Danford Colleges (2021)\nBachelor of Science in Marketing | Lyceum of Batangas University (1998)\nLean Six Sigma Black Belt | ACS Xerox\nProsci-Informed Change Practitioner (Experience-Based)\nTECHNICAL SKILLS\nMicrosoft 365 | SharePoint | Microsoft Intune | Azure AD | Conditional Access Policies | Office 365 | ServiceNow | Power BI | Jira | Visio | Miro\nTRAINING & DEVELOPMENT\nMicrosoft 365 & Power BI Reporting (Internal Uplift)\nFundamentals of Agile Business Analysis (Short Course)\nFundamentals of Cybersecurity (Self-paced)\nExposure to ACSC Essential 8 & ITIL v4 practices\nAVAILABILITY\nAvailable immediately | Open to business readiness and change implementation role\nReferee details available on request"
  }
]