[
  {
    "title": "PROFESSIONAL EXPERIENCE",
    "details": "PROFESSIONAL EXPERIENCE\nEnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 \t\nChange Manager – External Regulatory Changes\nKey Projects & Achievements:\nDelivered a high-impact regulatory change program aligning internal processes with updated energy compliance regulations, involving cross-functional teams across legal, operations, and IT.\nCreated a governance framework that reduced risk incidents by 20%, enabling proactive issue identification and remediation.\nImplemented change impact assessments and structured stakeholder communication plans, achieving 95% readiness pre-go-live.\nAIG Australia Limited\t\t\t\t\t\t\t\t\t\tJan 2020 – Oct 2024 \t\nOperations Program Lead and Business Support\nKey Projects & Achievements:\nLed a multi-stream transformation initiative modernizing underwriting and claims systems, integrating Power BI dashboards and achieving 30% improvement in executive reporting turnaround.\nManaged cross-departmental process standardisation initiative resulting in 15% efficiency uplift across APAC shared services.\nDesigned and delivered a data governance framework aligned with APRA and ASIC regulatory obligations.\nAIG Shared Services\t\t\t\t\t\t\t\t\t\tJan 2011 – Dec 2018 \t\nIT Business Project Manager\nKey Projects & Achievements:\nDirected over 15 global process migration projects across APAC and EMEA with full accountability for timelines, budgets, and resource allocations.\nDeveloped a comprehensive service transition toolkit used as a standard for all migrations, reducing project ramp-up time by 25%.\nMaintained 100% service continuity during handovers by coordinating daily stand-ups, risk reviews, and performance metrics tracking.\nACS Xerox\t\t\t\t\t\t\t\t\t\t\tJan 2010 – Nov 2011 \t\nProcess Improvement Leader\nKey Projects & Achievements:\nFacilitated call centre transformation using Lean Six Sigma resulting in 10% cost reduction and improved customer satisfaction scores.\nIntroduced a real-time performance dashboard to monitor and improve agent productivity, adopted enterprise-wide.\nPartnered with operations to design training rollout strategies that achieved 100% compliance with updated process standards."
  }
]