[
  {
    "title": "JAYSON MACASADIA\t\t            ",
    "descriptions": [
      "0432 241 891 | jmcasadia@gmail.com | www.linkedin.com/in/jayson-macasadia-00aa7132a/ | VIC 3012 EXECUTIVE SUMMARY Results-driven Strategic Portfolio and Governance Analyst with over a decade of experience supporting enterprise transformation programs through data-led reporting, KPI and benefits tracking, risk management, and executive insights. Skilled at collaborating with stakeholders across finance, technology, and operations to deliver timely and high-quality portfolio analysis, performance insights, and governance alignment. Experienced in supporting delivery across Agile, Lean, and Waterfall environments, with a strong focus on portfolio hygiene and continuous improvement. Areas of Expertise Process Improvement & Transformation | Lean Six Sigma (Black Belt) | Project Management | Cross-functional Leadership | Business Analysis | Customer Journey Mapping | Operational Excellence | Workshop Facilitation | Data Analytics & Reporting | Stakeholder Engagement | Design Thinking | Regulatory Compliance Change Management | Risk Management | Internal Auditing | Analytical Thinking | Results Focus KEY PROJECT HIGHLIGHTS Portfolio Governance & Performance Insights – AIG Australia Delivered governance reporting and portfolio insights to the COO, aligning with program KPIs, risk metrics, and financial targets. Monitored capex/opex performance and benefit realisation across enterprise-wide initiatives. Led reporting consolidation from multiple systems to present actionable insights through Power BI. Maintained strategic portfolio dashboards with milestone tracking, risk status, and initiative progress. Change & Transformation Delivery Support – EnergyAustralia Oversaw change governance and program alignment for regulatory and digital transformation portfolios. Produced executive dashboards tracking milestone progress, value realisation, and readiness metrics. Supported the PMO with consistent portfolio hygiene practices including schedule, risk, and KPI maintenance. Partnered with product, finance, and compliance teams to prepare go-to-market reporting and risk analyses. CAREER SUMMARY Change Manager at Energy Australia | Jan 2025 – March 2025 Operations Program & Business Support at AIG Australia Limited | Jan 2020 – Oct 2024 IT Business Manager at AIG | Nov 2011 – Oct 2018 Process Improvement Leader at ACS Xerox | Jan 2010 – Nov 2011 EDUCATION Bachelor of Information Technology | Kent University, 2025 Cert IV in Security Networking | Danford Colleges, 2021 Bachelor of Science in Marketing | Lyceum of Batangas University, 1998 TECHNICAL SKILLS Microsoft Power Platform: PowerApps, Power Automate, Power BI, Dynamics 365, SharePoint Online Cloud & DevOps: Azure (1.5 years' experience), Azure DevOps Programming & Development: JavaScript, SQL Project & Process Management: Agile, Waterfall, Business Process Automation Reporting & BI: Power BI, Data Analytics & Reporting IT Tools: Microsoft Project, SQL Studio, MS Visio PROFESSIONAL EXPERIENCE EnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 Change Manager LProvided portfolio governance and reporting support across regulatory and digital change programs. Delivered strategic reports tracking initiative status, milestone delivery, and benefits realization. Worked closely with the PMO to ensure portfolio hygiene, including schedule and risk updates. Partnered with finance and operational stakeholders to align KPI reporting with strategic objectives. Developed templates and reporting tools to improve consistency in performance tracking. Facilitated continuous improvement initiatives in change reporting and business readiness processes. Participated in project planning workshops to align system rollouts with operational and risk controls. AIG Australia Limited\t\t\t\t\t\t\t\t\t\tJan 2020 – Oct 2024 Operations Program Lead and Business Support Maintained portfolio-level risk registers and produced governance reports for executive reviews. Led performance reporting for capex/opex tracking, benefits realization, and quarterly business reviews. Supported data consolidation and Power BI dashboard design for initiative health and financial status. Liaised with delivery teams to document issues, risks, and mitigation plans across multiple programs. Established consistent reporting practices across business units aligned with portfolio metrics. Delivered stakeholder insights to guide prioritization and strategic alignment decisions. Facilitated leadership meetings to review risk mitigation strategies and performance against KPIs. AIG Shared Services\t\t\t\t\t\t\t\t\t\tJan 2011 – Dec 2018 IT Business Analyst Coordinated operational reporting, project tracking, and planning support across transformation programs. Worked with IT and business stakeholders to identify schedule risks and align reporting outputs. Implemented reporting dashboards and standardized governance templates to streamline stakeholder communication. Documented key project risks, escalations, and tracked resolution status across distributed teams. Contributed to the continuous improvement of delivery governance and reporting frameworks. Supported integration of reporting data into service delivery and business operations dashboards. Supported service inspections and coordinated stakeholder reporting during process migrations. ACS Xerox\t\t\t\t\t\t\t\t\t\t\tJan 2010 – Nov 2011 Process Improvement Leader Conducted service workflow reviews and recommended enhancements for customer support operations. Developed training and reporting tools to monitor service desk trends and identify opportunities for performance uplift. Developed communication assets, onboarding packs, and FAQs to support delivery. Facilitated workshops to explain process changes and capture staff feedback. Contributed to internal change newsletters and support content across business units. Monitored uptake and stakeholder sentiment using structured feedback tools. Referee details available on request"
    ]
  }
]