[
  {
    "title": "PROFESSIONAL EXPERIENCE",
    "details": "PROFESSIONAL EXPERIENCE\nEnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 \t\nChange Manager – External Regulatory Changes\nLed end-to-end implementation of operational changes linked to regulatory and technology projects within wrap-adjacent operations.\nDelivered business readiness plans and impact assessments to operational and leadership teams.\nFacilitated workshops with stakeholders across product, delivery, and operations to align project rollouts with wrap support processes.\nCoordinated with training and knowledge management teams to produce updated SOPs and rollout communications.\nMaintained wrap operations performance metrics pre- and post-change, tracking user readiness and adoption.\nServed as operational liaison to project teams, resolving BAU issues and post-implementation risks.\nAIG Australia Limited\t\t\t\t\t\t\t\t\t\tJan 2020 – Oct 2024 \t\nOperations Program Lead and Business Support\nManaged delivery planning, operational risk reporting, and change rollout communications across insurance support functions.\nDeveloped stakeholder packs and pre-go-live implementation dashboards for product and legislative changes.\nPartnered with PMs, technical staff, and delivery leads to plan and execute wrap-style process transitions.\nProduced readiness and capacity assessment documentation to support workforce planning.\nEngaged with BA and product leads to translate requirements into implementation actions.\nReviewed business documents and ensured consistent change documentation for handover.\nAIG Shared Services\t\t\t\t\t\t\t\t\t\tJan 2011 – Dec 2018 \t\nIT Business Analyst\nSupported change and system rollout initiatives in shared operations environments, including wrap platform components.\nActed as implementation lead for operational changes, coordinating go-live tasks and training activities.\nLiaised with change, training, and BA teams to align system enhancements with service team readiness.\nDocumented business impact across teams and coordinated BAU adoption metrics and performance tracking.\nParticipated in post-go-live issue management and cross-functional workshops.\nEnsured continuous alignment with wrap operational expectations during transformation efforts."
  }
]