[
  {
    "title": "PROFESSIONAL EXPERIENCE",
    "details": "PROFESSIONAL EXPERIENCE"
  },
  {
    "title": "EnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 \t",
    "details": "EnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 \t\nChange Lead – Regulatory Compliance\nDelivered regulatory transformation initiatives across utilities operations, focusing on systems and process alignment with compliance mandates.\nMapped business processes for compliance and field operations teams, supporting stakeholder-driven re-engineering efforts.\nDocumented detailed requirements and user stories, coordinating with architects and implementation teams to validate system impacts.\nOrganized and facilitated cross-functional workshops to ensure alignment across Operations and Compliance.\nAssisted project governance by maintaining risk logs, preparing steering committee briefs, and ensuring alignment with enterprise frameworks.\nActed as a liaison between field operations, regulatory teams, and project stakeholders, ensuring consistent understanding and timely communication."
  },
  {
    "title": "AIG Australia Limited\t\t\t\t\t\t\t\t\t\tJan 2020 – Oct 2024 \t",
    "details": "AIG Australia Limited\t\t\t\t\t\t\t\t\t\tJan 2020 – Oct 2024 \t\nOperations Program Lead and Business Support\nActed as lead BA across concurrent digital projects involving mobile apps, web platforms, and backend systems.\nGathered, refined, and prioritised requirements for Agile delivery teams using Scrum methodologies.\nMaintained detailed documentation including business rules, workflows, and acceptance criteria.\nFacilitated workshops, sprint planning, and daily standups to ensure team alignment and delivery cadence.\nSupported QA during testing phases and provided clarity on stories and test conditions.\nContributed to MVP scoping and release planning across digital product initiatives.\nLiaised with internal teams to gather and analyse business requirements for customer-facing platforms.\nDeveloped functional specs and collaborated with technical teams to implement digital enhancements.\nCreated UAT plans and assisted stakeholders through the testing process.\nIdentified process improvement opportunities and aligned solutions with business objectives.\nUsed Jira and Confluence to manage backlogs, documentation, and change requests."
  },
  {
    "title": "AIG Shared Services\t\t\t\t\t\t\t\t\t\tJan 2011 – Dec 2018 \t",
    "details": "AIG Shared Services\t\t\t\t\t\t\t\t\t\tJan 2011 – Dec 2018 \t\nIT Business Project Manager / Business Analyst\nSpearheaded functional solutioning for global process transitions and system migrations across HR, claims, and service platforms.\nPartnered with business and technology leaders to document use cases, functional requirements, and workflow diagrams for delivery teams.\nCreated standardized templates for BRDs and traceability matrices, improving alignment between business expectations and development deliverables.\nFacilitated UAT strategy creation, test scenario mapping, and feedback validation.\nSupported vendor-led solution implementation, acting as liaison to bridge operational priorities and system design.\nContributed to knowledge sharing and training programs to support long-term system adoption across teams."
  },
  {
    "title": "ACS Xerox\t\t\t\t\t\t\t\t\t\t\tJan 2010 – Nov 2011 \t",
    "details": "ACS Xerox\t\t\t\t\t\t\t\t\t\t\tJan 2010 – Nov 2011 \t\nProcess Improvement Leader\nDelivered business analysis and process improvement services for client support and digital transformation programs.\nAnalyzed workflows and system interactions, recommending process re-engineering to enhance service quality.\nSupported delivery of updated SOPs and training materials aligned to newly adopted technologies and workflows.\nDeveloped dashboards and status reports to track implementation readiness and success metrics.\nParticipated in workshops to validate revised business processes and drive user adoption strategies.\nCollaborated closely with operational stakeholders to ensure requirements met both business logic and customer experience objectives.\nReferee details available on request"
  }
]