[
  {
    "title": "PROFESSIONAL EXPERIENCE",
    "details": "PROFESSIONAL EXPERIENCE\nEnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 \t\nChange Manager\nLed change delivery for government-mandated regulatory transformation initiatives across operations and digital platforms.\nCoordinated change readiness, training, and communications for regulatory implementation across multiple business units.\nPartnered with analytics and reporting teams to track project compliance, adoption metrics, and risk status.\nEnsured alignment between regulatory objectives and internal business processes.\nDeveloped playbooks, process change documentation, and supported system updates tied to new regulatory frameworks.\nSupported stakeholder engagement, including with legal, compliance, and external government bodies.\nAIG Australia Limited\t\t\t\t\t\t\t\t\t\tJan 2020 – Oct 2024 \t\nData and Reporting Governance Lead\nDelivered end-to-end reporting solutions to support actuarial, finance, claims underwriting and operational efficiency.\nConducted detailed data audits and compliance reviews to support regulatory assurance requirements.\nDeveloped actionable reports and visual dashboards for executive teams using SQL and Power BI.\nCollaborated with business leaders and IT to implement data models supporting capital works and office safety planning.\nStandardised data queries and streamlined reporting processes for underwriting and claims operations.\nAdvised on stakeholder data needs and implemented enhancements based on user feedback.\nAIG Shared Services\t\t\t\t\t\t\t\t\t\tJan 2011 – Dec 2018 \t\nOperations Analyst – Workforce & Project Reporting\nOversaw reporting processes related to project resource tracking, procurement alignment, and cost centre performance.\nCreated automated Excel dashboards to report on workforce planning KPIs and contractor utilisation.\nSupported project and operational teams in aligning reporting tools with business planning cycles.\nWorked cross-functionally with IT and HR to improve process transparency and documentation standards.\nProduced reporting documentation used in internal audits and executive board reviews.\nContributed to the development of governance reporting templates and shared knowledge libraries.\nACS Xerox\t\t\t\t\t\t\t\t\t\t\tJan 2010 – Nov 2011 \t\nProcess Improvement Leader\nFacilitated call centre transformation using Lean Six Sigma resulting in 10% cost reduction and improved customer satisfaction scores.\nIntroduced a real-time performance dashboard to monitor and improve agent productivity, adopted enterprise-wide.\nPartnered with operations to design training rollout strategies that achieved 100% compliance with updated process standards."
  }
]