[
  {
    "title": "PROFESSIONAL EXPERIENCE",
    "details": "PROFESSIONAL EXPERIENCE"
  },
  {
    "title": "EnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 \t",
    "details": "EnergyAustralia\t\t\t\t\t\t\t\t\t\t\tJan 2025 – Mar 2025 \t\nChange Manager\nLProvided portfolio governance and reporting support across regulatory and digital change programs.\nDelivered strategic reports tracking initiative status, milestone delivery, and benefits realization.\nWorked closely with the PMO to ensure portfolio hygiene, including schedule and risk updates.\nPartnered with finance and operational stakeholders to align KPI reporting with strategic objectives.\nDeveloped templates and reporting tools to improve consistency in performance tracking.\nFacilitated continuous improvement initiatives in change reporting and business readiness processes.\nParticipated in project planning workshops to align system rollouts with operational and risk controls."
  },
  {
    "title": "AIG Australia Limited\t\t\t\t\t\t\t\t\t\tJan 2020 – Oct 2024 \t",
    "details": "AIG Australia Limited\t\t\t\t\t\t\t\t\t\tJan 2020 – Oct 2024 \t\nOperations Program Lead and Business Support\nMaintained portfolio-level risk registers and produced governance reports for executive reviews.\nLed performance reporting for capex/opex tracking, benefits realization, and quarterly business reviews.\nSupported data consolidation and Power BI dashboard design for initiative health and financial status.\nLiaised with delivery teams to document issues, risks, and mitigation plans across multiple programs.\nEstablished consistent reporting practices across business units aligned with portfolio metrics.\nDelivered stakeholder insights to guide prioritization and strategic alignment decisions.\nFacilitated leadership meetings to review risk mitigation strategies and performance against KPIs."
  },
  {
    "title": "AIG Shared Services\t\t\t\t\t\t\t\t\t\tJan 2011 – Dec 2018 \t",
    "details": "AIG Shared Services\t\t\t\t\t\t\t\t\t\tJan 2011 – Dec 2018 \t\nIT Business Analyst\nCoordinated operational reporting, project tracking, and planning support across transformation programs.\nWorked with IT and business stakeholders to identify schedule risks and align reporting outputs.\nImplemented reporting dashboards and standardized governance templates to streamline stakeholder communication.\nDocumented key project risks, escalations, and tracked resolution status across distributed teams.\nContributed to the continuous improvement of delivery governance and reporting frameworks.\nSupported integration of reporting data into service delivery and business operations dashboards.\nSupported service inspections and coordinated stakeholder reporting during process migrations."
  },
  {
    "title": "ACS Xerox\t\t\t\t\t\t\t\t\t\t\tJan 2010 – Nov 2011 \t",
    "details": "ACS Xerox\t\t\t\t\t\t\t\t\t\t\tJan 2010 – Nov 2011 \t\nProcess Improvement Leader\nConducted service workflow reviews and recommended enhancements for customer support operations.\nDeveloped training and reporting tools to monitor service desk trends and identify opportunities for performance uplift.\nDeveloped communication assets, onboarding packs, and FAQs to support delivery.\nFacilitated workshops to explain process changes and capture staff feedback.\nContributed to internal change newsletters and support content across business units.\nMonitored uptake and stakeholder sentiment using structured feedback tools.\nReferee details available on request"
  }
]